W7D3/Music_app/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def show
        @albums = Album.find_by(id: params[:id])